In [1]:
# Import libraries
import pandas as pd
import json

# Import SQL Alchemy
from sqlalchemy import create_engine

In [2]:
# Import CSV data into DataFrame
# The 2nd row contains the actual header, so supply header param.


# Data Source: https://trends.google.com/trends/explore?date=2004-12-31%202017-12-31&geo=US&q=new%20video%20games,xbox%20games,playstation%20games,nintendo%20games
google_trends_df = pd.read_csv('resources/google_trends.csv', header=[1])
google_trends_df.head()

,Month,new video games: (United States),xbox games: (United States),playstation games: (United States),nintendo games: (United States)
0,2005-01,2,40,20,16
1,2005-02,3,26,14,16
2,2005-03,2,25,16,16
3,2005-04,2,29,13,13
4,2005-05,3,37,14,16

In [3]:
# Simply the col haders
google_trends_df.columns = ['year_month', 'new_games', 'xbox', 'playstation', 'nintendo']
google_trends_df.head()

  year_month  new_games  xbox  playstation  nintendo
0    2005-01          2    40           20        16
1    2005-02          3    26           14        16
2    2005-03          2    25           16        16
3    2005-04          2    29           13        13
4    2005-05          3    37           14        16

In [4]:
# split year_month to two separate cols.
google_trends_df[['year', 'month']] = google_trends_df['year_month'].str.split('-',expand=True)

google_trends_df.head()

  year_month  new_games  xbox  playstation  nintendo  year month
0    2005-01          2    40           20        16  2005    01
1    2005-02          3    26           14        16  2005    02
2    2005-03          2    25           16        16  2005    03
3    2005-04          2    29           13        13  2005    04
4    2005-05          3    37           14        16  2005    05

In [5]:
# Drop the col that's no longer needed.
cleaned_google_trends_df = google_trends_df.drop('year_month', axis=1)
cleaned_google_trends_df

     new_games  xbox  playstation  nintendo  year month
0            2    40           20        16  2005    01
1            3    26           14        16  2005    02
2            2    25           16        16  2005    03
3            2    29           13        13  2005    04
4            3    37           14        16  2005    05
..         ...   ...          ...       ...   ...   ...
151          1    37            8        15  2017    08
152          1    35            8        18  2017    09
153          1    34            8        20  2017    10
154          2    69           14        37  2017    11
155          2    76           16        49  2017    12

[156 rows x 6 columns]

In [6]:
# Export to a JSON format
# https://stackoverflow.com/questions/39257147/convert-pandas-dataframe-to-json-format
google_trends = cleaned_google_trends_df.to_json(orient = "records")

In [7]:
# Output to a json file for record
with open('google_trends.json', 'w') as f:
    f.write(google_trends)

google_trends_df.to_csv('google_trends.csv')

In [8]:
# Import Video Games Global Sales in Volume 1983-2017
# Source: https://data.world/julienf/video-games-global-sales-in-volume-1983-2017

sales_df = pd.read_csv('resources/vgsales-20210428-18_46_23.csv')
sales_df.head()

,Unnamed: 0,Rank,Name,Platform,Publisher,Developer,Critic_Score,User_Score,Global_Sales,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Year
0,0,5001,Prince of Persia: The Two Thrones,XB,Ubisoft Montreal,Ubisoft,NaN,NaN,0.58m,0.33m,0.22m,NaN,0.03m,01st Dec 05
1,1,5002,I Am Bread,PC,Bossa Studios,Bossa Studios,NaN,NaN,NaN,NaN,NaN,NaN,NaN,09th Apr 15
2,2,5003,Gex: Enter The Gecko,PS,Crystal Dynamics,Midway Games,NaN,NaN,0.58m,0.32m,0.22m,NaN,0.04m,31st Jan 98
3,3,5004,Shrek 2: Beg for Mercy,GBA,Vicarious Visions,Activision,NaN,NaN,0.58m,0.42m,0.15m,NaN,0.01m,27th Oct 04
4,4,5005,Contra: Shattered Soldier,PS2,Konami Computer Entertainment Tokyo,Konami,7.3,NaN,0.58m,0.28m,0.22m,NaN,0.07m,22nd Oct 02

In [9]:
# Checking to see whethe any cols are missing.
sales_df.count()

Unnamed: 0      2026
Rank            2026
Name            2026
Platform        2026
Publisher       2026
Developer       2026
Critic_Score     553
User_Score        26
Global_Sales    1839
NA_Sales        1569
EU_Sales        1522
JP_Sales         593
Other_Sales     1683
Year            1906
dtype: int64

In [10]:
# Convert the date field into separate year and month
sales_df['Year'] = pd.to_datetime(sales_df['Year'])
sales_df[['year', 'month']] = sales_df['Year'].dt.strftime('%Y-%m').str.split('-',expand=True)
sales_df.drop(['Year'], axis=1, inplace=True)

In [11]:
# Drop the first, unnamed column as it is not needed
sales_df.drop(sales_df.columns[[0]], axis = 1, inplace = True)
sales_df.head()

,Rank,Name,Platform,Publisher,Developer,Critic_Score,User_Score,Global_Sales,NA_Sales,EU_Sales,JP_Sales,Other_Sales,year,month
0,5001,Prince of Persia: The Two Thrones,XB,Ubisoft Montreal,Ubisoft,NaN,NaN,0.58m,0.33m,0.22m,NaN,0.03m,2005,12
1,5002,I Am Bread,PC,Bossa Studios,Bossa Studios,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2015,04
2,5003,Gex: Enter The Gecko,PS,Crystal Dynamics,Midway Games,NaN,NaN,0.58m,0.32m,0.22m,NaN,0.04m,1998,01
3,5004,Shrek 2: Beg for Mercy,GBA,Vicarious Visions,Activision,NaN,NaN,0.58m,0.42m,0.15m,NaN,0.01m,2004,10
4,5005,Contra: Shattered Soldier,PS2,Konami Computer Entertainment Tokyo,Konami,7.3,NaN,0.58m,0.28m,0.22m,NaN,0.07m,2002,10

In [12]:
# Replace m(illion) in Sales figures.
columns = ['Global_Sales', 'NA_Sales', 'EU_Sales', 'JP_Sales' , 'Other_Sales']

for col in columns:
    sales_df[col] = sales_df[col].str.replace('m','')

In [13]:
sales = sales_df.to_json(orient = "records")

with open('sales.json', 'w') as f:
    f.write(sales)

sales_df.to_csv('sales.csv')

In [14]:
engine = create_engine(

SyntaxError: unexpected EOF while parsing (<ipython-input-14-5ada848c4388>, line 1)